Public Attributes | List of all members
API_StairQuantity Struct Reference
Element Manager API
Calculates values for stairs. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | area
The front surface area of the stair.
double  | volume
Volume of the stair.
double  | height
Height of the stair.
double  | walklineLength
Length of the stair's walking line.
double  | gradient
Inclination angle of the stair.
Int32  | numOfRisers
Number of risers in this stair.
Int32  | numOfTreads
Number of treads in this stair.
Detailed Description
Calculates values for stairs.
Member Data Documentation
◆ area
 API_StairQuantity::area
The front surface area of the stair.
◆ gradient
 API_StairQuantity::gradient
Inclination angle of the stair.
◆ height
 API_StairQuantity::height
Height of the stair.
◆ numOfRisers
 API_StairQuantity::numOfRisers
Number of risers in this stair.
◆ numOfTreads
 API_StairQuantity::numOfTreads
Number of treads in this stair.
◆ volume
 API_StairQuantity::volume
Volume of the stair.
◆ walklineLength
 API_StairQuantity::walklineLength
Length of the stair's walking line.